vxnu20/stm32f103x-driver/src/main.c
#include "stm32f103x_gpio.h"
#include "stm32f103x_systick.h"
#include "stm32f103x_usart.h"
#include "stm32f103x_adc.h"
#include "stm32f103x_rcc.h"
#include "stm32f103x_timer.h"
#include <stdio.h>


int main()
{
    // char buffer[20];

    /* enable clock for peripherals */

    // rcc_enable_adc_clock(ADC1);
    // rcc_enable_adc_clock(ADC2);
    // rcc_enable_gpio_clock(GPIO_PORTA);
    // rcc_enable_gpio_clock(GPIO_PORTB);
    // rcc_enable_gpio_clock(GPIO_PORTC);
    // rcc_enable_usart_clock(USART1);
    // rcc_enable_usart_clock(USART2);
    // rcc_enable_usart_clock(USART3);
    // rcc_enable_gpio_clock(GPIO_PORTA);
    // rcc_enable_gpio_clock(GPIO_PORTB);
    // rcc_enable_gpio_clock(GPIO_PORTC);
    // rcc_enable_timer_clock(TIM1);
    // rcc_enable_timer_clock(TIM2);
    // rcc_enable_timer_clock(TIM3);
    // rcc_enable_timer_clock(TIM4);

    /* onboard user led */
    gpio_set_mode(GPIO_PORTC, 13, GPIO_MODE_OUT2MHZ, GN_PUSH_PULL);
    
    /* uart1 for logging purpose */
    gpio_set_mode(GPIO_PORTA, 9, GPIO_MODE_OUT2MHZ, ALT_PUSH_PULL);
    // gpio_set_mode(GPIO_PORTA, 10, GPIO_MODE_IN, FLOATING_INPUT);
    usart_init(USART1, USART_DEFAULT_BAUD);
    /* uart config end */

    /* enable system tick */
    systick_init(CPU_DEFAULT_FREQ/1000);

    /* adc config example */
    // gpio_set_mode(GPIO_PORTA, 0, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 1, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 2, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 3, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 4, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 5, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 6, GPIO_MODE_IN, ANALOG);
    // gpio_set_mode(GPIO_PORTA, 7, GPIO_MODE_IN, ANALOG);
    
    // adc_config config;
    // config.adc = ADC1;
    // config.conversion_mode = continuous_conversion;

    // config.channel_config[0].channel = channel0;
    // config.channel_config[0].sampling_time= adc_sampling239_5;

    // config.channel_config[1].channel = channel1;
    // config.channel_config[1].sampling_time= adc_sampling239_5;

    // config.channel_config[0].channel = channel2;
    // config.channel_config[0].sampling_time = adc_sampling239_5;

    // config.channel_config[0].channel = channel3;
    // config.channel_config[0].sampling_time = adc_sampling239_5;

    // config.channel_config[0].channel = channel4;
    // config.channel_config[0].sampling_time = adc_sampling71_5;

    // config.channel_config[0].channel = channel5;
    // config.channel_config[0].sampling_time = adc_sampling71_5;

    // config.channel_config[0].channel = channel6;
    // config.channel_config[0].sampling_time = adc_sampling71_5;

    // config.channel_config[0].channel = channel7;
    // config.channel_config[0].sampling_time = adc_sampling71_5;
    
    // config.no_of_channels = 2;

    // adc_init(config);
    // _delay(200);
    // adc_start_conversion(config.adc);

    /* adc config end */

    /* sample timer config for testing purpose */
    rcc_enable_timer_clock(TIM2);
    timer_config config;
    config.timer = TIM2;
    config.prescalar = TIM_DEFAULT_PRE_SCLAR;
    config.auto_reload = TIM_DEFAULT_AUTO_RELOAD;
    timer_init(config);
    /* timer channel config */
    timer_channel_output_config out_config;
    out_config.channel = t_channel1;
    out_config.mode = t_toggle_mode;
    timer_enable_output_compare(TIM2,out_config);

    timer_channel_input_config in_config;
    in_config.channel = t_channel2;
    in_config.prescalar = t_no_prescalar;
    in_config.selection = t_channel_ic2_ti1;
    timer_enable_input_capture(TIM2, in_config);

    timer_start(config.timer);

    /* timer config end */
    while(1)
    {
        
        // while(!(config.timer -> SR & TIM_SR_UF));
        // gpio_pin_toggle(GPIO_PORTC,13);
        // config.timer -> SR &= ~TIM_SR_UF;

        // uint32_t value = adc_read_value(config.adc);
        uint16_t count = timer_read_count(config.timer);
        // sprintf(buffer, "timer count -> %d \n", count);
        // usart_write_string(USART1,buffer);
    }

    return 0;
}